fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры	

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовФормы

 &НаСервере
 Процедура СпециалистПриИзмененииНаСервере()
	 
	ТекстУведомления = СтрШаблон("Заявка %1 от %2 изменена. Отвественным назначен %3. К работе приступить %4 в %5 ",
	Объект.Клиент, Формат(Объект.Дата, "ДЛФ=D"),
	Объект.Специалист,
	Формат(Объект.ДатаПроведенияРабот, "ДЛФ=D"),
	Формат(Объект.ВремяНачалаРаботПлан,"ДЛФ=T"));

	ДокОбъект = РеквизитФормыВЗначение("Объект");
   	ДокОбъект.СоздатьУведомлениеТГБоту(ТекстУведомления);
	
КонецПроцедуры

&НаСервере
Процедура ДатаПроведенияРаботПриИзмененииНаСервере()
	
	ТекстУведомления = СтрШаблон("Заявка %1 от %2 изменена дата оказания услуги. %3 к работе приступить %4 в %5 ",
	Объект.Клиент, Формат(Объект.Дата, "ДЛФ=D"),
	Объект.Специалист,
	Формат(Объект.ДатаПроведенияРабот, "ДЛФ=D"),
	Формат(Объект.ВремяНачалаРаботПлан,"ДЛФ=T"));
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
   	ДокОбъект.СоздатьУведомлениеТГБоту(ТекстУведомления); 
	
КонецПроцедуры

&НаСервере
Процедура ВремяНачалаРаботПланПриИзмененииНаСервере() 
	
	ТекстУведомления = СтрШаблон("Заявка %1 от %2 изменено время оказания услуги. %3 к работе приступить %4 в %5 ",
	Объект.Клиент, Формат(Объект.Дата, "ДЛФ=D"),
	Объект.Специалист,
	Формат(Объект.ДатаПроведенияРабот, "ДЛФ=D"),
	Формат(Объект.ВремяНачалаРаботПлан,"ДЛФ=T"));
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
   	ДокОбъект.СоздатьУведомлениеТГБоту(ТекстУведомления);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпециалистПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	Иначе
		СпециалистПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте

Процедура ДатаПроведенияРаботПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	Иначе
		ДатаПроведенияРаботПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаРаботПланПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	Иначе
		ВремяНачалаРаботПланПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры  

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
